{
  "grades": [
    {
      "key": "g1",
      "label": "1年生の漢字",
      "iconText": "1",
      "color": "#fffa99",
      "characters": "一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六"
    },
    {
      "key": "g2",
      "label": "2年生の漢字",
      "iconText": "2",
      "color": "#ffd199",
      "characters": "引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電刀冬当東答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話"
    },
    {
      "key": "g3",
      "label": "3年生の漢字",
      "iconText": "3",
      "color": "#ff9999",
      "characters": "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"
    },
    {
      "key": "g4",
      "label": "4年生の漢字",
      "iconText": "4",
      "color": "#99ffce",
      "characters": "愛案以衣位茨印英栄媛塩岡億加果貨課芽賀改械害街各覚潟完官管関観願岐希季旗器機議求泣給挙漁共協鏡競極熊訓軍郡群径景芸欠結建健験固功好香候康佐差菜最埼材崎昨札刷察参産散残氏司試児治滋辞鹿失借種周祝順初松笑唱焼照城縄臣信井成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲沖兆低底的典伝徒努灯働特徳栃奈梨熱念敗梅博阪飯飛必票標不夫付府阜富副兵別辺変便包法望牧末満未民無約勇要養浴利陸良料量輪類令冷例連老労録"
    },
    {
      "key": "g5",
      "label": "5年生の漢字",
      "iconText": "5",
      "color": "#a399ff",
      "characters": "圧囲移因永営衛易益液演応往桜可仮価河過快解格確額刊幹慣眼紀基寄規喜技義逆久旧救居許境均禁句型経潔件険検限現減故個護効厚耕航鉱構興講告混査再災妻採際在財罪殺雑酸賛士支史志枝師資飼示似識質舎謝授修述術準序招証象賞条状常情織職制性政勢精製税責績接設絶祖素総造像増則測属率損貸態団断築貯張停提程適統堂銅導得毒独任燃能破犯判版比肥非費備評貧布婦武復複仏粉編弁保墓報豊防貿暴脈務夢迷綿輸余容略留領歴"
    },
    {
      "key": "g6",
      "label": "6年生の漢字",
      "iconText": "6",
      "color": "#d699ff",
      "characters": "胃異遺域宇映延沿恩我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴券絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除承将傷障蒸針仁垂推寸盛聖誠舌宣専泉洗染銭善奏窓創装層操蔵臓存尊退宅担探誕段暖値宙忠著庁頂腸潮賃痛敵展討党糖届難乳認納脳派拝背肺俳班晩否批秘俵腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優預幼欲翌乱卵覧裏律臨朗論"
    },
    {
      "key": "g7",
      "label": "中学生の漢字",
      "iconText": "中",
      "color": "#ff66ff",
      "characters": "亜哀挨握扱宛闇依偉威尉慰椅為畏維緯萎違壱逸稲芋咽姻淫陰隠韻臼渦唄浦餌影詠鋭疫悦謁越閲宴怨援炎煙猿縁艶鉛汚凹奥押旺欧殴翁憶臆乙俺卸穏佳嫁寡暇架禍稼箇苛華菓蚊牙雅餓介塊壊怪悔懐戒拐皆劾崖慨概涯蓋該骸垣柿嚇核殻獲穫較郭隔岳顎掛喝括渇滑葛褐轄且釜鎌刈瓦乾冠勘勧喚堪寛患憾換敢棺款歓汗環甘監緩缶肝艦貫還鑑閑陥韓含玩頑企伎奇幾忌既棋棄畿祈軌輝飢騎鬼亀偽儀宜戯擬欺犠菊吉喫詰却脚虐丘及朽窮糾巨拒拠虚距享凶叫峡恐恭挟況狂狭矯脅響驚仰凝暁僅巾錦斤琴緊菌襟謹吟駆駒愚虞偶遇隅串屈掘窟靴繰桑勲薫傾刑啓契恵慶憩掲携渓稽継茎蛍詣鶏迎鯨撃隙桁傑倹兼剣圏堅嫌懸拳献肩謙賢軒遣鍵顕幻弦玄舷孤弧枯股虎誇雇顧鼓互呉娯御悟碁乞侯勾喉坑孔巧恒慌抗拘控攻更梗江洪溝甲硬稿絞綱肯荒衡貢購郊酵項剛拷豪克酷獄腰込頃墾婚恨懇昆痕紺魂唆沙詐鎖挫債催塞宰彩栽歳采砕斎載剤咲削搾柵索錯拶撮擦傘惨桟斬暫伺刺嗣施旨祉紫肢脂諮賜雌侍慈璽軸執嫉湿漆疾芝赦斜煮遮蛇邪爵酌釈寂朱殊狩珠腫趣儒呪寿需囚愁秀臭舟襲蹴酬醜充柔汁渋獣銃叔淑粛塾俊瞬准循旬殉潤盾巡遵庶緒叙徐償匠升召奨宵尚床彰抄掌昇晶沼渉焦症硝礁祥称粧紹肖衝訟詔詳鐘丈冗剰壌嬢浄畳譲醸錠嘱飾拭殖触辱尻伸侵唇娠寝審慎振浸紳芯薪診辛震刃尋甚尽腎迅陣須酢吹帥炊睡粋衰遂酔随髄崇枢据杉裾澄瀬畝是凄姓征牲誓請逝醒斉隻惜戚斥析籍脊跡拙摂窃仙占扇栓潜煎旋繊羨腺薦詮践遷鮮漸禅繕膳塑措曽狙疎礎租粗訴阻遡僧双喪壮爽捜掃挿曹槽燥痩荘葬藻遭霜騒憎贈促即捉俗賊袖遜汰唾堕妥惰駄堆耐怠戴替泰滞胎袋逮滝卓択拓沢濯託濁諾但奪脱棚誰丹嘆旦淡端綻胆鍛壇弾恥痴稚致遅畜蓄逐秩窒嫡抽衷酎鋳駐弔彫徴懲挑眺聴超跳勅捗朕沈珍鎮陳津墜椎塚漬潰坪爪釣鶴亭偵貞呈堤帝廷抵締艇訂諦逓邸泥摘滴溺哲徹撤迭添貼殿吐塗妬斗渡賭途奴怒倒凍唐塔悼搭桃棟盗痘筒到藤謄踏逃透陶騰闘憧洞瞳胴峠匿督篤凸突屯豚頓曇鈍那謎鍋軟尼弐匂虹如尿妊忍寧猫捻粘悩濃把覇婆罵廃排杯輩培媒賠陪伯拍泊舶薄迫漠爆縛箸肌鉢髪伐罰抜閥伴帆搬斑氾汎畔繁般藩販範煩頒盤蛮卑妃彼扉披泌疲碑罷被避尾微眉匹膝肘姫漂描苗浜賓頻敏瓶怖扶敷普浮符腐膚譜賦赴附侮舞封伏幅覆払沸噴墳憤紛雰丙併塀幣弊柄蔽壁癖蔑偏遍舗捕穂募慕簿倣俸奉峰崩抱泡砲縫胞芳蜂褒邦飽乏傍剖坊妨帽忙房某冒紡肪膨謀貌僕墨撲朴睦勃没堀奔翻凡盆摩磨魔麻埋昧膜枕又抹繭慢漫魅岬蜜妙眠矛霧婿娘冥銘滅免麺茂妄猛盲網耗黙餅戻紋冶弥厄躍柳愉癒諭唯幽悠憂湧猶裕誘雄融与誉妖庸揚揺擁溶窯謡踊抑沃翼羅裸頼雷絡酪嵐欄濫藍吏履璃痢離硫粒隆竜侶慮虜了僚寮涼猟療瞭糧陵倫厘隣瑠塁涙累励鈴隷零霊麗齢暦劣烈裂廉恋錬呂炉賂露廊弄楼浪漏郎麓賄脇惑枠湾腕丼傲刹哺喩嗅嘲毀彙恣惧慄憬拉摯曖楷鬱璧瘍箋籠緻羞訃諧貪踪辣錮塡頰𠮟剝"
    },
    {
      "key": "other",
      "label": "常用漢字外の漢字",
      "iconText": "外",
      "color": "#ef4444"
    }
  ]
}
